#+TITLE: Shell Script Resilience
#+SUBTITLE: Overview of the Problem Space
#+AUTHOR: J. Greg Davidson
#+DATE: 18 October 2022
#+OPTIONS: toc:nil 
#+OPTIONS: num:nil
# +OPTIONS: date:nil 
# +OPTIONS: author:nil 

** Version 1: The Naive Script

If you know how to issue commands to a shell manually, then you can trivially
create a naive shell script:
- Create a new text file using your favorite editor
- Enter your desired commands into it
- Make the script executable with =chmod +x SCRIPT-FILE-NAME=
- To run it, either
      - specify a path to it when you run it
            - e.g. type =./SCRIPT-FILE-NAME= at the Shell Prompt
      - place it in a directory which is on your =$PATH=
            - e.g. =mv SCRIPT-FILE-NAME ~/bin=
            - so you can run it simply as =SCRIPT-FILE-NAME=

#+begin_src sh :results output
  echo Hello from ${0##*/}
  echo `date -I` is a good day to run!
#+end_src

#+RESULTS:
: Hello from sh
: 2022-10-18 is a good day to run!

**** Specifying an Interpreter

The excutable file is still just a text file, which won't do anything by itself.

Giving it execute permission doesn't say which program should be run to
/Interpret/ the script. So we get a system default, which may or may not be the
program we intended when we (or whoever) originally wrote the script.

We let the system know which program we would like it to use to /Interpret/ our
/Script/ with a [[https://en.wikipedia.org/wiki/Shebang_(Unix)][Shebang Line]] as the first line of the file.

If you're using =bash=, you can find out where a program is located on your
local system at the current time with the builtin =type= command.

#+begin_src bash :results output
 type bash 
#+end_src

#+RESULTS:
: bash is /usr/bin/bash

If you're using =bash=, you can get brief documentation about /any/ builtin
command using the builtin =help= command.

#+begin_src bash :results output
 help type
#+end_src

** Version 2: A Little Better

There is nothing wrong with creating a naive script, as long as you upgrade it
before using it again, and especially before giving it to anyone else to use!

So let's upgrade our script:

#+begin_src bash :results output
  #!/usr/bin/bash
  # Strip the directories off the executable program path
  script_name="${0##*/}"
  echo Hello from "$script_name"
  # Embed the ISO date in our message
  echo "`date -I` is a good day to run!"
#+end_src

#+RESULTS:
: Hello from bash
: 2022-10-18 is a good day to run!

There's not a lot of point making this script more resilient, but what about a
script which administers essential services?

